"""
ЗАДАНИЕ № 2
Представлен список чисел. Необходимо вывести элементы исходного списка, значения которых больше предыдущего элемента.
Подсказка: элементы, удовлетворяющие условию, оформить в виде списка. Для его формирования используйте генератор.
Пример исходного списка: [300, 2, 12, 44, 1, 1, 4, 10, 7, 1, 78, 123, 55].
Результат: [12, 44, 4, 10, 78, 123].
"""

source_list = [300, 2, 12, 44, 1, 1, 4, 10, 7, 1, 78, 123, 55]
result_list = [i for j, i in zip(source_list, source_list[1:]) if i > j]
result_list_1 = [source_list[ind] for ind in range(1, len(source_list)) if source_list[ind] > source_list[ind - 1]]
print(result_list)
print(result_list_1)
